bench.log
====== SET ======
  100000 requests completed in 0.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.023 milliseconds (cumulative count 2)
50.000% <= 0.207 milliseconds (cumulative count 58287)
75.000% <= 0.239 milliseconds (cumulative count 76484)
87.500% <= 0.295 milliseconds (cumulative count 89200)
93.750% <= 0.327 milliseconds (cumulative count 94552)
96.875% <= 0.359 milliseconds (cumulative count 97157)
98.438% <= 0.439 milliseconds (cumulative count 98472)
99.219% <= 1.047 milliseconds (cumulative count 99223)
99.609% <= 1.231 milliseconds (cumulative count 99614)
99.805% <= 1.519 milliseconds (cumulative count 99807)
99.902% <= 1.791 milliseconds (cumulative count 99911)
99.951% <= 1.919 milliseconds (cumulative count 99952)
99.976% <= 2.031 milliseconds (cumulative count 99976)
99.988% <= 2.047 milliseconds (cumulative count 99988)
99.994% <= 2.071 milliseconds (cumulative count 99994)
99.997% <= 2.087 milliseconds (cumulative count 99997)
99.998% <= 2.095 milliseconds (cumulative count 99999)
99.999% <= 2.103 milliseconds (cumulative count 100000)
100.000% <= 2.103 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.194% <= 0.103 milliseconds (cumulative count 194)
58.287% <= 0.207 milliseconds (cumulative count 58287)
90.811% <= 0.303 milliseconds (cumulative count 90811)
98.300% <= 0.407 milliseconds (cumulative count 98300)
98.635% <= 0.503 milliseconds (cumulative count 98635)
98.759% <= 0.607 milliseconds (cumulative count 98759)
98.865% <= 0.703 milliseconds (cumulative count 98865)
99.076% <= 0.807 milliseconds (cumulative count 99076)
99.192% <= 0.903 milliseconds (cumulative count 99192)
99.215% <= 1.007 milliseconds (cumulative count 99215)
99.373% <= 1.103 milliseconds (cumulative count 99373)
99.600% <= 1.207 milliseconds (cumulative count 99600)
99.649% <= 1.303 milliseconds (cumulative count 99649)
99.738% <= 1.407 milliseconds (cumulative count 99738)
99.797% <= 1.503 milliseconds (cumulative count 99797)
99.821% <= 1.607 milliseconds (cumulative count 99821)
99.839% <= 1.703 milliseconds (cumulative count 99839)
99.924% <= 1.807 milliseconds (cumulative count 99924)
99.948% <= 1.903 milliseconds (cumulative count 99948)
99.967% <= 2.007 milliseconds (cumulative count 99967)
100.000% <= 2.103 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 126422.25 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.227     0.016     0.207     0.335     0.783     2.103
====== GET ======
  100000 requests completed in 0.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.031 milliseconds (cumulative count 1)
50.000% <= 0.207 milliseconds (cumulative count 52032)
75.000% <= 0.271 milliseconds (cumulative count 76965)
87.500% <= 0.303 milliseconds (cumulative count 87697)
93.750% <= 0.327 milliseconds (cumulative count 94428)
96.875% <= 0.343 milliseconds (cumulative count 96881)
98.438% <= 0.367 milliseconds (cumulative count 98449)
99.219% <= 0.399 milliseconds (cumulative count 99230)
99.609% <= 0.455 milliseconds (cumulative count 99629)
99.805% <= 0.559 milliseconds (cumulative count 99814)
99.902% <= 0.631 milliseconds (cumulative count 99908)
99.951% <= 28.559 milliseconds (cumulative count 99953)
99.976% <= 28.671 milliseconds (cumulative count 99978)
99.988% <= 28.703 milliseconds (cumulative count 99990)
99.994% <= 28.735 milliseconds (cumulative count 99994)
99.997% <= 28.815 milliseconds (cumulative count 100000)
100.000% <= 28.815 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.043% <= 0.103 milliseconds (cumulative count 43)
52.032% <= 0.207 milliseconds (cumulative count 52032)
87.697% <= 0.303 milliseconds (cumulative count 87697)
99.321% <= 0.407 milliseconds (cumulative count 99321)
99.725% <= 0.503 milliseconds (cumulative count 99725)
99.885% <= 0.607 milliseconds (cumulative count 99885)
99.933% <= 0.703 milliseconds (cumulative count 99933)
99.948% <= 0.807 milliseconds (cumulative count 99948)
99.950% <= 1.103 milliseconds (cumulative count 99950)
100.000% <= 29.103 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 117785.63 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.240     0.024     0.207     0.335     0.391    28.815